app/controllers/main_controller.rb

SELECT "dns_lookups".* FROM "dns_lookups" WHERE "dns_lookups"."domain" = $1 LIMIT $2  [["domain", "apple.com.au"], ["LIMIT", 1]]
SELECT "dns_lookups".* FROM "dns_lookups" WHERE "dns_lookups"."domain" = $1 LIMIT $2  [["domain", "sybr.com.au"], ["LIMIT", 1]]
INSERT INTO "dns_lookups" ("domain", "aRecord", "mxRecord", "txtRecord", "soaRecord", "nsRecord", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def updateDNSRecordsToDatabase
    if DnsLookup.find_by(domain: @domain)
      @seenBefore = 'True'
      @dnsDB = DnsLookup.new
      lastSeen = DnsLookup.find_by(domain: @domain)
      @dnsDB.aRecord = @a unless lastSeen.aRecord == @a
      @dnsDB.mxRecord = @mx unless lastSeen.mxRecord == @mx
      @dnsDB.txtRecord = @txt unless lastSeen.txtRecord == @txt
      @dnsDB.soaRecord = @soa unless lastSeen.soaRecord == @soa
      @dnsDB.nsRecord = @ns unless lastSeen.nsRecord == @ns
      @dnsDB.save
    else
      @seenBefore = 'False'
      @dnsDB = DnsLookup.new
      @dnsDB.domain = @domain
      @dnsDB.aRecord = @a
      @dnsDB.mxRecord = @mx
      @dnsDB.txtRecord = @txt
      @dnsDB.soaRecord = @soa
      @dnsDB.nsRecord = @ns
      @dnsDB.save